--
-- BOX
--
--
-- box logic
--	     o
-- 3	  o--|X
--	  |  o|
-- 2	+-+-+ |
--	| | | |
-- 1	| o-+-o
--	|   |
-- 0	+---+
--
--	0 1 2 3
--
-- boxes are specified by two points, given by four floats x1,y1,x2,y2
CREATE TABLE BOX_TBL (f1 box);
ERROR:  cannot execute CREATE TABLE in a read-only transaction
INSERT INTO BOX_TBL (f1) VALUES ('(2.0,2.0,0.0,0.0)');
ERROR:  cannot execute INSERT in a read-only transaction
INSERT INTO BOX_TBL (f1) VALUES ('(1.0,1.0,3.0,3.0)');
ERROR:  cannot execute INSERT in a read-only transaction
-- degenerate cases where the box is a line or a point
-- note that lines and points boxes all have zero area
INSERT INTO BOX_TBL (f1) VALUES ('(2.5, 2.5, 2.5,3.5)');
ERROR:  cannot execute INSERT in a read-only transaction
INSERT INTO BOX_TBL (f1) VALUES ('(3.0, 3.0,3.0,3.0)');
ERROR:  cannot execute INSERT in a read-only transaction
-- badly formatted box inputs
INSERT INTO BOX_TBL (f1) VALUES ('(2.3, 4.5)');
ERROR:  invalid input syntax for type box: "(2.3, 4.5)"
LINE 1: INSERT INTO BOX_TBL (f1) VALUES ('(2.3, 4.5)');
                                         ^
INSERT INTO BOX_TBL (f1) VALUES ('asdfasdf(ad');
ERROR:  invalid input syntax for type box: "asdfasdf(ad"
LINE 1: INSERT INTO BOX_TBL (f1) VALUES ('asdfasdf(ad');
                                         ^
SELECT '' AS four, * FROM BOX_TBL;
 four |         f1          
------+---------------------
      | (2,2),(0,0)
      | (3,3),(1,1)
      | (2.5,3.5),(2.5,2.5)
      | (3,3),(3,3)
(4 rows)

SELECT '' AS four, b.*, area(b.f1) as barea
   FROM BOX_TBL b;
 four |         f1          | barea 
------+---------------------+-------
      | (2,2),(0,0)         |     4
      | (3,3),(1,1)         |     4
      | (2.5,3.5),(2.5,2.5) |     0
      | (3,3),(3,3)         |     0
(4 rows)

-- overlap
SELECT '' AS three, b.f1
   FROM BOX_TBL b
   WHERE b.f1 && box '(2.5,2.5,1.0,1.0)';
 three |         f1          
-------+---------------------
       | (2,2),(0,0)
       | (3,3),(1,1)
       | (2.5,3.5),(2.5,2.5)
(3 rows)

-- left-or-overlap (x only)
SELECT '' AS two, b1.*
   FROM BOX_TBL b1
   WHERE b1.f1 &< box '(2.0,2.0,2.5,2.5)';
 two |         f1          
-----+---------------------
     | (2,2),(0,0)
     | (2.5,3.5),(2.5,2.5)
(2 rows)

-- right-or-overlap (x only)
SELECT '' AS two, b1.*
   FROM BOX_TBL b1
   WHERE b1.f1 &> box '(2.0,2.0,2.5,2.5)';
 two |         f1          
-----+---------------------
     | (2.5,3.5),(2.5,2.5)
     | (3,3),(3,3)
(2 rows)

-- left of
SELECT '' AS two, b.f1
   FROM BOX_TBL b
   WHERE b.f1 << box '(3.0,3.0,5.0,5.0)';
 two |         f1          
-----+---------------------
     | (2,2),(0,0)
     | (2.5,3.5),(2.5,2.5)
(2 rows)

-- area <=
SELECT '' AS four, b.f1
   FROM BOX_TBL b
   WHERE b.f1 <= box '(3.0,3.0,5.0,5.0)';
 four |         f1          
------+---------------------
      | (2,2),(0,0)
      | (3,3),(1,1)
      | (2.5,3.5),(2.5,2.5)
      | (3,3),(3,3)
(4 rows)

-- area <
SELECT '' AS two, b.f1
   FROM BOX_TBL b
   WHERE b.f1 < box '(3.0,3.0,5.0,5.0)';
 two |         f1          
-----+---------------------
     | (2.5,3.5),(2.5,2.5)
     | (3,3),(3,3)
(2 rows)

-- area =
SELECT '' AS two, b.f1
   FROM BOX_TBL b
   WHERE b.f1 = box '(3.0,3.0,5.0,5.0)';
 two |     f1      
-----+-------------
     | (2,2),(0,0)
     | (3,3),(1,1)
(2 rows)

-- area >
SELECT '' AS two, b.f1
   FROM BOX_TBL b				-- zero area
   WHERE b.f1 > box '(3.5,3.0,4.5,3.0)';
 two |     f1      
-----+-------------
     | (2,2),(0,0)
     | (3,3),(1,1)
(2 rows)

-- area >=
SELECT '' AS four, b.f1
   FROM BOX_TBL b				-- zero area
   WHERE b.f1 >= box '(3.5,3.0,4.5,3.0)';
 four |         f1          
------+---------------------
      | (2,2),(0,0)
      | (3,3),(1,1)
      | (2.5,3.5),(2.5,2.5)
      | (3,3),(3,3)
(4 rows)

-- right of
SELECT '' AS two, b.f1
   FROM BOX_TBL b
   WHERE box '(3.0,3.0,5.0,5.0)' >> b.f1;
 two |         f1          
-----+---------------------
     | (2,2),(0,0)
     | (2.5,3.5),(2.5,2.5)
(2 rows)

-- contained in
SELECT '' AS three, b.f1
   FROM BOX_TBL b
   WHERE b.f1 <@ box '(0,0,3,3)';
 three |     f1      
-------+-------------
       | (2,2),(0,0)
       | (3,3),(1,1)
       | (3,3),(3,3)
(3 rows)

-- contains
SELECT '' AS three, b.f1
   FROM BOX_TBL b
   WHERE box '(0,0,3,3)' @> b.f1;
 three |     f1      
-------+-------------
       | (2,2),(0,0)
       | (3,3),(1,1)
       | (3,3),(3,3)
(3 rows)

-- box equality
SELECT '' AS one, b.f1
   FROM BOX_TBL b
   WHERE box '(1,1,3,3)' ~= b.f1;
 one |     f1      
-----+-------------
     | (3,3),(1,1)
(1 row)

-- center of box, left unary operator
SELECT '' AS four, @@(b1.f1) AS p
   FROM BOX_TBL b1;
 four |    p    
------+---------
      | (1,1)
      | (2,2)
      | (2.5,3)
      | (3,3)
(4 rows)

-- wholly-contained
SELECT '' AS one, b1.*, b2.*
   FROM BOX_TBL b1, BOX_TBL b2
   WHERE b1.f1 @> b2.f1 and not b1.f1 ~= b2.f1;
 one |     f1      |     f1      
-----+-------------+-------------
     | (3,3),(1,1) | (3,3),(3,3)
(1 row)

SELECT '' AS four, height(f1), width(f1) FROM BOX_TBL;
 four | height | width 
------+--------+-------
      |      2 |     2
      |      2 |     2
      |      1 |     0
      |      0 |     0
(4 rows)

--
-- Test the SP-GiST index
--
CREATE TEMPORARY TABLE box_temp (f1 box);
ERROR:  cannot execute CREATE TABLE in a read-only transaction
INSERT INTO box_temp
	SELECT box(point(i, i), point(i * 2, i * 2))
	FROM generate_series(1, 50) AS i;
ERROR:  relation "box_temp" does not exist
LINE 1: INSERT INTO box_temp
                    ^
CREATE INDEX box_spgist ON box_temp USING spgist (f1);
ERROR:  cannot execute CREATE INDEX in a read-only transaction
INSERT INTO box_temp
	VALUES (NULL),
		   ('(0,0)(0,100)'),
		   ('(-3,4.3333333333)(40,1)'),
		   ('(0,100)(0,infinity)'),
		   ('(-infinity,0)(0,infinity)'),
		   ('(-infinity,-infinity)(infinity,infinity)');
ERROR:  relation "box_temp" does not exist
LINE 1: INSERT INTO box_temp
                    ^
SET enable_seqscan = false;
SELECT * FROM box_temp WHERE f1 << '(10,20),(30,40)';
ERROR:  relation "box_temp" does not exist
LINE 1: SELECT * FROM box_temp WHERE f1 << '(10,20),(30,40)';
                      ^
EXPLAIN (COSTS OFF) SELECT * FROM box_temp WHERE f1 << '(10,20),(30,40)';
ERROR:  relation "box_temp" does not exist
LINE 1: EXPLAIN (COSTS OFF) SELECT * FROM box_temp WHERE f1 << '(10,...
                                          ^
SELECT * FROM box_temp WHERE f1 &< '(10,4.333334),(5,100)';
ERROR:  relation "box_temp" does not exist
LINE 1: SELECT * FROM box_temp WHERE f1 &< '(10,4.333334),(5,100)';
                      ^
EXPLAIN (COSTS OFF) SELECT * FROM box_temp WHERE f1 &< '(10,4.333334),(5,100)';
ERROR:  relation "box_temp" does not exist
LINE 1: EXPLAIN (COSTS OFF) SELECT * FROM box_temp WHERE f1 &< '(10,...
                                          ^
SELECT * FROM box_temp WHERE f1 && '(15,20),(25,30)';
ERROR:  relation "box_temp" does not exist
LINE 1: SELECT * FROM box_temp WHERE f1 && '(15,20),(25,30)';
                      ^
EXPLAIN (COSTS OFF) SELECT * FROM box_temp WHERE f1 && '(15,20),(25,30)';
ERROR:  relation "box_temp" does not exist
LINE 1: EXPLAIN (COSTS OFF) SELECT * FROM box_temp WHERE f1 && '(15,...
                                          ^
SELECT * FROM box_temp WHERE f1 &> '(40,30),(45,50)';
ERROR:  relation "box_temp" does not exist
LINE 1: SELECT * FROM box_temp WHERE f1 &> '(40,30),(45,50)';
                      ^
EXPLAIN (COSTS OFF) SELECT * FROM box_temp WHERE f1 &> '(40,30),(45,50)';
ERROR:  relation "box_temp" does not exist
LINE 1: EXPLAIN (COSTS OFF) SELECT * FROM box_temp WHERE f1 &> '(40,...
                                          ^
SELECT * FROM box_temp WHERE f1 >> '(30,40),(40,30)';
ERROR:  relation "box_temp" does not exist
LINE 1: SELECT * FROM box_temp WHERE f1 >> '(30,40),(40,30)';
                      ^
EXPLAIN (COSTS OFF) SELECT * FROM box_temp WHERE f1 >> '(30,40),(40,30)';
ERROR:  relation "box_temp" does not exist
LINE 1: EXPLAIN (COSTS OFF) SELECT * FROM box_temp WHERE f1 >> '(30,...
                                          ^
SELECT * FROM box_temp WHERE f1 <<| '(10,4.33334),(5,100)';
ERROR:  relation "box_temp" does not exist
LINE 1: SELECT * FROM box_temp WHERE f1 <<| '(10,4.33334),(5,100)';
                      ^
EXPLAIN (COSTS OFF) SELECT * FROM box_temp WHERE f1 <<| '(10,4.33334),(5,100)';
ERROR:  relation "box_temp" does not exist
LINE 1: EXPLAIN (COSTS OFF) SELECT * FROM box_temp WHERE f1 <<| '(10...
                                          ^
SELECT * FROM box_temp WHERE f1 &<| '(10,4.3333334),(5,1)';
ERROR:  relation "box_temp" does not exist
LINE 1: SELECT * FROM box_temp WHERE f1 &<| '(10,4.3333334),(5,1)';
                      ^
EXPLAIN (COSTS OFF) SELECT * FROM box_temp WHERE f1 &<| '(10,4.3333334),(5,1)';
ERROR:  relation "box_temp" does not exist
LINE 1: EXPLAIN (COSTS OFF) SELECT * FROM box_temp WHERE f1 &<| '(10...
                                          ^
SELECT * FROM box_temp WHERE f1 |&> '(49.99,49.99),(49.99,49.99)';
ERROR:  relation "box_temp" does not exist
LINE 1: SELECT * FROM box_temp WHERE f1 |&> '(49.99,49.99),(49.99,49...
                      ^
EXPLAIN (COSTS OFF) SELECT * FROM box_temp WHERE f1 |&> '(49.99,49.99),(49.99,49.99)';
ERROR:  relation "box_temp" does not exist
LINE 1: EXPLAIN (COSTS OFF) SELECT * FROM box_temp WHERE f1 |&> '(49...
                                          ^
SELECT * FROM box_temp WHERE f1 |>> '(37,38),(39,40)';
ERROR:  relation "box_temp" does not exist
LINE 1: SELECT * FROM box_temp WHERE f1 |>> '(37,38),(39,40)';
                      ^
EXPLAIN (COSTS OFF) SELECT * FROM box_temp WHERE f1 |>> '(37,38),(39,40)';
ERROR:  relation "box_temp" does not exist
LINE 1: EXPLAIN (COSTS OFF) SELECT * FROM box_temp WHERE f1 |>> '(37...
                                          ^
SELECT * FROM box_temp WHERE f1 @> '(10,11),(15,16)';
ERROR:  relation "box_temp" does not exist
LINE 1: SELECT * FROM box_temp WHERE f1 @> '(10,11),(15,16)';
                      ^
EXPLAIN (COSTS OFF) SELECT * FROM box_temp WHERE f1 @> '(10,11),(15,15)';
ERROR:  relation "box_temp" does not exist
LINE 1: EXPLAIN (COSTS OFF) SELECT * FROM box_temp WHERE f1 @> '(10,...
                                          ^
SELECT * FROM box_temp WHERE f1 <@ '(10,15),(30,35)';
ERROR:  relation "box_temp" does not exist
LINE 1: SELECT * FROM box_temp WHERE f1 <@ '(10,15),(30,35)';
                      ^
EXPLAIN (COSTS OFF) SELECT * FROM box_temp WHERE f1 <@ '(10,15),(30,35)';
ERROR:  relation "box_temp" does not exist
LINE 1: EXPLAIN (COSTS OFF) SELECT * FROM box_temp WHERE f1 <@ '(10,...
                                          ^
SELECT * FROM box_temp WHERE f1 ~= '(20,20),(40,40)';
ERROR:  relation "box_temp" does not exist
LINE 1: SELECT * FROM box_temp WHERE f1 ~= '(20,20),(40,40)';
                      ^
EXPLAIN (COSTS OFF) SELECT * FROM box_temp WHERE f1 ~= '(20,20),(40,40)';
ERROR:  relation "box_temp" does not exist
LINE 1: EXPLAIN (COSTS OFF) SELECT * FROM box_temp WHERE f1 ~= '(20,...
                                          ^
RESET enable_seqscan;
DROP INDEX box_spgist;
ERROR:  cannot execute DROP INDEX in a read-only transaction
--
-- Test the SP-GiST index on the larger volume of data
--
CREATE TABLE quad_box_tbl (b box);
ERROR:  cannot execute CREATE TABLE in a read-only transaction
INSERT INTO quad_box_tbl
	SELECT box(point(x * 10, y * 10), point(x * 10 + 5, y * 10 + 5))
	FROM generate_series(1, 100) x,
		 generate_series(1, 100) y;
ERROR:  cannot execute INSERT in a read-only transaction
-- insert repeating data to test allTheSame
INSERT INTO quad_box_tbl
	SELECT '((200, 300),(210, 310))'
	FROM generate_series(1, 1000);
ERROR:  cannot execute INSERT in a read-only transaction
INSERT INTO quad_box_tbl
	VALUES
		(NULL),
		(NULL),
		('((-infinity,-infinity),(infinity,infinity))'),
		('((-infinity,100),(-infinity,500))'),
		('((-infinity,-infinity),(700,infinity))');
ERROR:  cannot execute INSERT in a read-only transaction
CREATE INDEX quad_box_tbl_idx ON quad_box_tbl USING spgist(b);
ERROR:  cannot execute CREATE INDEX in a read-only transaction
SET enable_seqscan = OFF;
SET enable_indexscan = ON;
SET enable_bitmapscan = ON;
SELECT count(*) FROM quad_box_tbl WHERE b <<  box '((100,200),(300,500))';
 count 
-------
   901
(1 row)

SELECT count(*) FROM quad_box_tbl WHERE b &<  box '((100,200),(300,500))';
 count 
-------
  3901
(1 row)

SELECT count(*) FROM quad_box_tbl WHERE b &&  box '((100,200),(300,500))';
 count 
-------
  1653
(1 row)

SELECT count(*) FROM quad_box_tbl WHERE b &>  box '((100,200),(300,500))';
 count 
-------
 10100
(1 row)

SELECT count(*) FROM quad_box_tbl WHERE b >>  box '((100,200),(300,500))';
 count 
-------
  7000
(1 row)

SELECT count(*) FROM quad_box_tbl WHERE b >>  box '((100,200),(300,500))';
 count 
-------
  7000
(1 row)

SELECT count(*) FROM quad_box_tbl WHERE b <<| box '((100,200),(300,500))';
 count 
-------
  1900
(1 row)

SELECT count(*) FROM quad_box_tbl WHERE b &<| box '((100,200),(300,500))';
 count 
-------
  5901
(1 row)

SELECT count(*) FROM quad_box_tbl WHERE b |&> box '((100,200),(300,500))';
 count 
-------
  9100
(1 row)

SELECT count(*) FROM quad_box_tbl WHERE b |>> box '((100,200),(300,500))';
 count 
-------
  5000
(1 row)

SELECT count(*) FROM quad_box_tbl WHERE b @>  box '((201,301),(202,303))';
 count 
-------
  1003
(1 row)

SELECT count(*) FROM quad_box_tbl WHERE b <@  box '((100,200),(300,500))';
 count 
-------
  1600
(1 row)

SELECT count(*) FROM quad_box_tbl WHERE b ~=  box '((200,300),(205,305))';
 count 
-------
     1
(1 row)

RESET enable_seqscan;
RESET enable_indexscan;
RESET enable_bitmapscan;
